apartment_app/app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
    def index
        apartments = Apartment.all

INSERT INTO "apartments" ("street", "city", "state", "manager", "email", "price", "bedrooms", "bathrooms", "pets", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def create
        apartment = Apartment.create(apartment_params)

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "apartments" SET "bedrooms" = $1, "bathrooms" = $2, "updated_at" = $3 WHERE "apartments"."id" = $4  [["bedrooms", 5], ["bathrooms", 3], ["updated_at", "2020-08-27 18:43:51.550250"], ["id", 4]]
---
    def update
        apartment = Apartment.find(params[:id])
        apartment.update(apartment_params)

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 7]]
---
    def destroy
        apartment=Apartment.find(params[:id])
        apartment.destroy